---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FamilyInstance Properties
FamilyInstance Class See Also Send Feedback
---

The FamilyInstance type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | AssemblyInstanceId | The id of the assembly instance to which the element belongs.  (Inherited from Element.) |
|  | BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from Element.) |
|  | CanFlipFacing | Property to test whether the orientation of family instance facing can be flipped. |
|  | CanFlipHand | Property to test whether the orientation of family instance hand can be flipped. |
|  | CanFlipWorkPlane | Identifies if the instance can flip its work plane. |
|  | CanRotate | Property to test whether the family instance can be rotated by 180 degrees. |
|  | CanSplit | Identifies whether a particular family instance can be split at a point on it's defining curve (by Split(Double)). |
|  | Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from Element.) |
|  | CreatedPhaseId | Id of a Phase at which the Element was created.  (Inherited from Element.) |
|  | DemolishedPhaseId | Id of a Phase at which the Element was demolished.  (Inherited from Element.) |
|  | DesignOption | Returns the design option to which the element belongs. (Inherited from Element.) |
|  | Document | Returns the Document in which the Element resides. (Inherited from Element.) |
|  | ExtensionUtility | Property to check whether the instance can be extended and return the interface for extension operation. |
|  | FacingFlipped | Property to test whether the orientation of family instance facing is flipped. |
|  | FacingOrientation | Property to get the orientation of family instance facing. |
|  | FromRoom | The "From Room" set for the door or window in the last phase of the project. |
|  | [FromRoom[([( Phase])]) ](c4a37990-0603-50e0-ca97-1cd5449940dd.md) |  |
|  | Geometry | Retrieves the geometric representation of the element. (Inherited from Element.) |
|  | GroupId | The id of the group to which an element belongs.  (Inherited from Element.) |
|  | HandFlipped | Property to test whether the orientation of family instance hand is flipped. |
|  | HandOrientation | Property to get the orientation of family instance hand. |
|  | HasSpatialElementCalculationPoint | Identifies if this instance has a single SpatialElementCalculationPoint used as the search point for Revit to identify if the instance is inside a room or space. |
|  | HasSpatialElementFromToCalculationPoints | Identifies if this instance has a pair of SpatialElementCalculationPoints used as the search points for Revit to identify if the instance lies between up to two rooms or spaces. |
|  | Host | If the instance is contained within another element, this property returns the containing element. An instance that is face hosted will return the element containing the face. |
|  | HostFace | Property to get the reference to the host face of family instance. |
|  | HostParameter | If the instance is hosted by a wall, this property returns the parameter value of the insertion point of the instance along the wall's location curve, as long as the family of the instance isn't work plane based. |
|  | Id | A unique identifier for an Element in an Autodesk Revit project.  (Inherited from Element.) |
|  | Invisible | Property to test whether the family instance is invisible. |
|  | IsModifiable | Identifies if the element is modifiable.  (Inherited from Element.) |
|  | IsSlantedColumn | Indicates if the family instance is a slanted column. |
|  | IsTransient | Indicates whether an element is transient or permanent.  (Inherited from Element.) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Element.) |
|  | IsWorkPlaneFlipped | Identifies if the instance's work plane is flipped. |
|  | LevelId | The id of the level associated with the element.  (Inherited from Element.) |
|  | Location | This property is used to find the physical location of an instance within project. (Overrides Element..::..Location.) |
|  | MEPModel | Retrieves the MEP model for the family instance. |
|  | Mirrored | Property to test whether the family instance is mirrored. (only one axis is flipped) |
|  | Name | A human readable name for the Element. (Inherited from Element.) |
|  | OwnerViewId | The id of the view that owns the element.  (Inherited from Element.) |
|  | [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md) | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
|  | [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md) | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
|  | [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md) | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |
|  | Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from Element.) |
|  | ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from Element.) |
|  | Pinned | Identifies if the element has been pinned to prevent changes.  (Inherited from Element.) |
|  | Room | The room in which the instance is located (during the last phase of the project). |
|  | [Room[([( Phase])]) ](5c1ed572-e744-3ab6-9b10-bb258a66f23a.md) |  |
|  | Space | The space in which the instance is located (during the last phase of the project). |
|  | [Space[([( Phase])]) ](36fcee11-77d9-80a7-2321-5bf163137ac3.md) |  |
|  | StructuralMaterialId | Identifies the material that defines the instance's structural analysis properties. |
|  | StructuralMaterialType | This property returns the physical material from which the instance is made. |
|  | StructuralType | Provides the primary structural type of the instance, such as beam or column etc. |
|  | StructuralUsage | Provides the primary structural usage of the instance, such as brace, girder etc. |
|  | SuperComponent | Property to get the super component of current family instance. |
|  | Symbol | Returns or changes the FamilySymbol object that represents the type of the instance. |
|  | ToRoom | The "To Room" set for the door or window in the last phase of the project. |
|  | [ToRoom[([( Phase])]) ](94e34f74-b6d1-2e4b-df44-b93aac5543c6.md) |  |
|  | UniqueId | A stable unique identifier for an element within the document.  (Inherited from Element.) |
|  | VersionGuid | Get the element version Guid.  (Inherited from Element.) |
|  | ViewSpecific | Identifies if the element is owned by a view.  (Inherited from Element.) |
|  | WorksetId | Get Id of the Workset which owns the element.  (Inherited from Element.) |

# See Also

FamilyInstance Class

Autodesk.Revit.DB Namespace